Feature: Добавяне на оценка на ученик

  Scenario: Въвеждане данни във формата за нанасяне на оценка с валидно име оценка и премет
    Given Отваряме екрана за нанасяне на оценка
    When Въведем име: "Georgi Ivanov", във формата за нанасяне на оценка
    And Въведем оценка: 4, във формата за нанасяне на оценка
    And Въведем предмет: "Mathematics", във формата за нанасяне на оценка
    And Натиснем бутона за запазване на оценка
    Then Виждаме съобщение: "Успещно добавихте оценката на ученика Georgi Ivanov за предмета Mathematics";, от формата за нанасяне на оценка

  Scenario: Въвеждане данни във формата за нанасяне на оценка с липсващо име
    Given Отваряме екрана за нанасяне на оценка
    When Въведем оценка: 4, във формата за нанасяне на оценка
    And Въведем предмет: "Mathematics", във формата за нанасяне на оценка
    And Натиснем бутона за запазване на оценка
    Then Виждаме съобщение: "Не сте въвели ученик", от формата за нанасяне на оценка

  Scenario: Въвеждане данни във формата за нанасяне на оценка с оценка под 2
    Given Отваряме екрана за нанасяне на оценка
    When Въведем име: "Georgi Ivanov", във формата за нанасяне на оценка
    And Въведем оценка: 1, във формата за нанасяне на оценка
    And Въведем предмет: "Mathematics", във формата за нанасяне на оценка
    And Натиснем бутона за запазване на оценка
    Then Виждаме съобщение: "Минималната оценка е 2", от формата за нанасяне на оценка

  Scenario: Въвеждане данни във формата за нанасяне на оценка с оценка над 6
    Given Отваряме екрана за нанасяне на оценка
    When Въведем име: "Georgi Ivanov", във формата за нанасяне на оценка
    And Въведем оценка: 7, във формата за нанасяне на оценка
    And Въведем предмет: "Mathematics", във формата за нанасяне на оценка
    And Натиснем бутона за запазване на оценка
    Then Виждаме съобщение: "Максималната оценка е 6", от формата за нанасяне на оценка

  Scenario: Въвеждане данни във формата за нанасяне на оценка с липсващ предмет
    Given Отваряме екрана за нанасяне на оценка
    When Въведем име: "Georgi Ivanov", във формата за нанасяне на оценка
    And Въведем оценка: 4, във формата за нанасяне на оценка
    And Натиснем бутона за запазване на оценка
    Then Виждаме съобщение: "Не сте въвели предмет", от формата за нанасяне на оценка

  Scenario: Въвеждане данни във формата за нанасяне на оценка с невалиден предмет
    Given Отваряме екрана за нанасяне на оценка
    When Въведем име: "Georgi Ivanov", във формата за нанасяне на оценка
    And Въведем оценка: 4, във формата за нанасяне на оценка
    And Въведем предмет: "Test", във формата за нанасяне на оценка
    And Натиснем бутона за запазване на оценка
    Then Виждаме съобщение: "Няма такъвива предмети", от формата за нанасяне на оценка
