Feature: Добавяне на ученик към клас

Scenario: Въвеждане данни във формата за добавяне на ученик с валидно име и клас
Given Отваряме екрана за добавяне на ученик 
When Въведем клас: "7A", във формата за добавяне на ученик
And Въведем ученик: "Georgi Ivanov", във формата за добавяне на ученик
And Натиснем бутона за запазване, във формата за добавяне на ученик
Then Виждаме съобщение: "Успешно добавихте ученика към класа", от формата за добавяне на ученик

Scenario: Въвеждане данни във формата за добавяне на ученик с липсващо име
Given Отваряме екрана за добавяне на ученик 
When Въведем клас: "7A", във формата за добавяне на ученик
And Натиснем бутона за запазване, във формата за добавяне на ученик
Then Виждаме съобщение: "Не сте въвели ученик", от формата за добавяне на ученик

Scenario: Въвеждане данни във формата за добавяне на ученик с невалидно име
Given Отваряме екрана за добавяне на ученик 
When Въведем клас: "7A", във формата за добавяне на ученик
And Въведем ученик: "Dimitar Kazakov", във формата за добавяне на ученик
And Натиснем бутона за запазване, във формата за добавяне на ученик
Then Виждаме съобщение: "Няма такъв ученик", от формата за добавяне на ученик

Scenario: Въвеждане данни във формата за добавяне на ученик с липсващ клас
Given Отваряме екрана за добавяне на ученик 
When Въведем ученик: "Georgi Ivanov", във формата за добавяне на ученик
And Натиснем бутона за запазване, във формата за добавяне на ученик
Then Виждаме съобщение: "Не сте въвели клас", от формата за добавяне на ученик

Scenario: Въвеждане данни във формата за добавяне на ученик с невалиден клас
Given Отваряме екрана за добавяне на ученик 
When Въведем клас: "7Z", във формата за добавяне на ученик
And Въведем ученик: "Georgi Ivanov", във формата за добавяне на ученик
And Натиснем бутона за запазване, във формата за добавяне на ученик
Then Виждаме съобщение: "Няма такъв клас", от формата за добавяне на ученик