Feature: Вход в системата

  Scenario: Вход в системата с валидно име и парола и имейл като ученик
    Given Отваряме екрана за вход в системата
    When Въведем име: "Georgi Ivanov"
    And Въведем парола: "iv123!"
    And Въведем имейл: "stu.ivanov@gmail.com"
    And Натиснем бутона за вход
    Then Виждаме съобщение: "Здравейте ученик, вие влязохте в системата"

  Scenario: Вход в системата с валидно име и парола и имейл като учител
    Given Отваряме екрана за вход в системата
    When Въведем име: "Mrs. Ivanova"
    And Въведем парола: "ivanova123!"
    And Въведем имейл: "school.ivanova@gmail.com"
    And Натиснем бутона за вход
    Then Виждаме съобщение: "Здравейте учител, вие влязохте в системата"

  Scenario: Вход в системата с валидно име и парола и имейл като родител
    Given Отваряме екрана за вход в системата
    When Въведем име: "Ivan Ivanov"
    And Въведем парола: "qwerty1234!"
    And Въведем имейл: "ivan.ivanov@gmail.com"
    And Натиснем бутона за вход
    Then Виждаме съобщение: "Здравейте родител, вие влязохте в системата"

  Scenario: Вход в системата с невалидно име и парола и имейл
    Given Отваряме екрана за вход в системата
    When Въведем име: "test"
    And Въведем парола: "test"
    And Въведем имейл: "test"
    And Натиснем бутона за вход
    Then Виждаме съобщение: "Грешни данни"

  Scenario: Вход в системата без име
    Given Отваряме екрана за вход в системата
    When Въведем парола: "iv123"
    And Въведем имейл: "stu.ivanov@gmail.com"
    And Натиснем бутона за вход
    Then Виждаме съобщение: "Не сте въвели име"

  Scenario: Вход в системата без парола
    Given Отваряме екрана за вход в системата
    When Въведем име: "Georgi Ivanov"
    And Въведем имейл: "stu.ivanov@gmail.com"
    And Натиснем бутона за вход
    Then Виждаме съобщение: "Не сте въвели парола"

  Scenario: Вход в системата без имейл
    Given Отваряме екрана за вход в системата
    When Въведем име: "Georgi Ivanov"
    And Въведем парола: "iv123"
    And Натиснем бутона за вход
    Then Виждаме съобщение: "Не сте въвели имейл"
