Feature: Планиране на контролно изпитване

Scenario: Въвеждане данни във формата за планиране на контролно с валиден клас и предмет
Given Отваряме екрана за провеждане на контролно изпитване
When Въведем клас: "7А", във формата за провеждане на контролно изпитване
And Въведем предмет: "Mathematics", във формата за провеждане на контролно изпитване
And Натиснем бутона за запазване на изпит, във формата за провеждане на контролно изпитване
Then Виждаме съобщение: "Успешно насрочихте контролно по Mathematics за клас 7А", от формата за провеждане на контролно изпитване

Scenario: Въвеждане данни във формата за планиране на контролно с липсващ клас
Given Отваряме екрана за провеждане на контролно изпитване
When Въведем предмет: "Mathematics", във формата за провеждане на контролно изпитване
And Натиснем бутона за запазване на изпит, във формата за провеждане на контролно изпитване
Then Виждаме съобщение: "Не сте въвели клас", от формата за провеждане на контролно изпитване

Scenario: Въвеждане данни във формата за планиране на контролно с невалиден клас 
Given Отваряме екрана за провеждане на контролно изпитване
When Въведем клас: "7Z", във формата за провеждане на контролно изпитване
And Въведем предмет: "Mathematics", във формата за провеждане на контролно изпитване
And Натиснем бутона за запазване на изпит, във формата за провеждане на контролно изпитване
Then Виждаме съобщение: "Няма такъв клас", от формата за провеждане на контролно изпитване

Scenario: Въвеждане данни във формата за планиране на контролно с липсващ предмет
Given Отваряме екрана за провеждане на контролно изпитване
When Въведем клас: "7Z", във формата за провеждане на контролно изпитване
And Натиснем бутона за запазване на изпит, във формата за провеждане на контролно изпитване
Then Виждаме съобщение: "Не сте въвели предмет", от формата за провеждане на контролно изпитване

Scenario: Въвеждане данни във формата за планиране на контролно с невалиден предмет
Given Отваряме екрана за провеждане на контролно изпитване
When Въведем клас: "7Z", във формата за провеждане на контролно изпитване
And Въведем предмет: "Test", във формата за провеждане на контролно изпитване
And Натиснем бутона за запазване на изпит, във формата за провеждане на контролно изпитване
Then Виждаме съобщение: "Няма такъвива предмети", от формата за провеждане на контролно изпитване