Feature: Редактиране на оценка

  Scenario: Въвеждане данни във формата с валидно име оценка и премет
    Given Отваряме екрана за редактиране на оценка
    When Въведем име: "Georgi Ivanov", във формата за редактиране на оценка
    And Въведем оценка: 5, във формата за редактиране на оценка
    And Въведем предмет: "Mathematics", във формата за редактиране на оценка
    And Натиснем бутона за редакция, във формата за редактиране на оценка
    Then Виждаме съобщение: "Успещно редактирахте оценката на ученика Georgi Ivanov по предмета Mathematics", от формата за редактиране на оценка

  Scenario: Въвеждане данни във формата с липсващо име
    Given Отваряме екрана за редактиране на оценка
    When Въведем оценка: 5, във формата за редактиране на оценка
    And Въведем предмет: "Mathematics", във формата за редактиране на оценка
    And Натиснем бутона за редакция, във формата за редактиране на оценка
    Then Виждаме съобщение: "Не сте въвели ученик", от формата за редактиране на оценка

  Scenario: Въвеждане данни във формата с оценка под 2
    Given Отваряме екрана за редактиране на оценка
    When Въведем име: "Georgi Ivanov", във формата за редактиране на оценка
    And Въведем оценка: 1, във формата за редактиране на оценка
    And Въведем предмет: "Mathematics", във формата за редактиране на оценка
    And Натиснем бутона за редакция, във формата за редактиране на оценка
    Then Виждаме съобщение: "Минималната оценка е 2", от формата за редактиране на оценка

  Scenario: Въвеждане данни във формата с оценка над 6
    Given Отваряме екрана за редактиране на оценка
    When Въведем име: "Georgi Ivanov", във формата за редактиране на оценка
    And Въведем оценка: 7, във формата за редактиране на оценка
    And Въведем предмет: "Mathematics", във формата за редактиране на оценка
    And Натиснем бутона за редакция, във формата за редактиране на оценка
    Then Виждаме съобщение: "Максималната оценка е 6", от формата за редактиране на оценка

  Scenario: Въвеждане данни във формата с липсващ предмет
    Given Отваряме екрана за редактиране на оценка
    When Въведем име: "Georgi Ivanov", във формата за редактиране на оценка
    And Въведем оценка: 5, във формата за редактиране на оценка
    And Натиснем бутона за редакция, във формата за редактиране на оценка
    Then Виждаме съобщение: "Не сте въвели предмет", от формата за редактиране на оценка

  Scenario: Въвеждане данни във формата с невалиден предмет
    Given Отваряме екрана за редактиране на оценка
    When Въведем име: "Georgi Ivanov", във формата за редактиране на оценка
    And Въведем оценка: 5, във формата за редактиране на оценка
    And Въведем предмет: "Test", във формата за редактиране на оценка
    And Натиснем бутона за редакция, във формата за редактиране на оценка
    Then Виждаме съобщение: "Няма такъв предмет", от формата за редактиране на оценка

  Scenario: Въвеждане данни във формата с невалидна оценка за ученика
    Given Отваряме екрана за редактиране на оценка
    When Въведем име: "Georgi Ivanov", във формата за редактиране на оценка
    And Въведем оценка: 4, във формата за редактиране на оценка
    And Въведем предмет: "Mathematics", във формата за редактиране на оценка
    And Натиснем бутона за редакция, във формата за редактиране на оценка
    Then Виждаме съобщение: "Ученика няма оценка по този предмет", от формата за редактиране на оценка
